app/views/pokes/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."username" = 'System' LIMIT 1
---
<% if current_user %>
	<% if current_user == User.find_by(username: 'System') %>