app/views/pokes/show.html.erb

SELECT "pokes".* FROM "pokes" INNER JOIN "user_pokemons" ON "pokes"."id" = "user_pokemons"."poke_id" WHERE "user_pokemons"."user_id" = ? AND "pokes"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
---
<% if current_user %>
  <% unless current_user.pokes.find(@poke.id) %>