app/views/catpoks/new.html.erb

SELECT "pokes"."name", "pokes"."id" FROM "pokes"
---
	<%= f.label :poke_id, "Pokemon", class: "input-group" %>
	<%= f.select :poke_id, Poke.pluck(:name, :id), {} , class: "form-control" %>

SELECT "categories"."nombre", "categories"."id" FROM "categories"
---
	<%= f.label :category_id, "Category" , class: "input-group"%>
	<%= f.select :category_id, Category.pluck(:nombre, :id), {} , class: "form-control", id:"sel1"%>