app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC
---
  def index
    @categories = Category.order(:id)

INSERT INTO "categories" ("created_at", "nombre", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 06 Dec 2016 05:23:28 UTC +00:00], ["nombre", "FUeg"], ["updated_at", Tue, 06 Dec 2016 05:23:28 UTC +00:00]]
---
  def create
  	@category = Category.new(category_params)

    if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."nombre" = 'FUeg' LIMIT 1
---
  def list
    @category = Category.find_by(nombre: params[:nombre])