app/controllers/catpoks_controller.rb

INSERT INTO "catpoks" ("category_id", "created_at", "poke_id", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["created_at", Tue, 06 Dec 2016 05:29:12 UTC +00:00], ["poke_id", 1], ["updated_at", Tue, 06 Dec 2016 05:29:12 UTC +00:00]]
---
  def create
  	@catpok = Catpok.new(catpok_params)

    if @catpok.save