app/controllers/pokes_controller.rb

SELECT "pokes".* FROM "pokes" ORDER BY "pokes"."name" ASC
---
  def index
    @pokes = Poke.order(:name)

SELECT "pokes".* FROM "pokes" WHERE "pokes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @poke = Poke.find(params[:id])

INSERT INTO "pokes" ("attack", "avatar_url", "created_at", "defense", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["attack", 432], ["avatar_url", "3"], ["created_at", Tue, 06 Dec 2016 04:32:14 UTC +00:00], ["defense", 23], ["name", "Pik"], ["updated_at", Tue, 06 Dec 2016 04:32:14 UTC +00:00]]
---
  def create
    @poke = Poke.new(poke_params)

    if @poke.save

SELECT "pokes".* FROM "pokes" WHERE "pokes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @poke = Poke.find(params[:id])