app/controllers/reviews_controller.rb

SELECT "pokes".* FROM "pokes" WHERE "pokes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
  @poke = Poke.find(params[:poke_id])

SELECT "pokes".* FROM "pokes" WHERE "pokes"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "reviews" ("created_at", "descripcion", "poke_id", "rev", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 12 Dec 2016 16:29:53 UTC +00:00], ["descripcion", "user"], ["poke_id", 2], ["rev", 4], ["updated_at", Mon, 12 Dec 2016 16:29:53 UTC +00:00], ["user_id", 4]]
---
def create
  @poke = Poke.find(params[:poke_id])
  @review = @poke.reviews.build(reviews_params)

  @review.user_id=current_user.id
  if @review.save

SELECT "pokes".* FROM "pokes" WHERE "pokes"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."poke_id" = ? AND "reviews"."id" = ? LIMIT 1  [["poke_id", 2], ["id", "7"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 7]]
---
def destroy
  @poke = Poke.find(params[:poke_id])
  @review = @poke.reviews.find(params[:id])
  @review.destroy