app/controllers/sessions_controller.rb

  def create
  	password = params[:session][:password]
    username = params[:session][:username]


    @user = User.find_by(email: username) || User.find_by(username: username)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'yolo@unitec.edu' LIMIT 1