app/controllers/user_pokemons_controller.rb

  def create
    @user_pokemon = UserPokemon.new(user_pokemon_params)

    if @user_pokemon.save
      UserNotifier.pokemon_catch(current_user, Poke.find_by(id: @user_pokemon.poke_id)).deliver
---
INSERT INTO "user_pokemons" ("created_at", "poke_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 11 Dec 2016 05:24:19 UTC +00:00], ["poke_id", 2], ["updated_at", Sun, 11 Dec 2016 05:24:19 UTC +00:00], ["user_id", 1]]
SELECT "pokes".* FROM "pokes" WHERE "pokes"."id" = 1 LIMIT 1