app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?)

  def update
    @user = User.find_by(id: params[:id])

    if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 8  [["username", "Salazr123"], ["password_digest", "$2a$10$VfvFXHIb4Ts9fUfDsTMOvuhuKmvM0bvaKeuXhxiEyKWLmJNJK2zhO"], ["updated_at", Tue, 13 Dec 2016 15:31:26 UTC +00:00]]