app/views/reviews/_review.html.erb

	<td><%= format_date(review.created_at) %></td>
	<td><%= User.find(review.user_id).username%></td>
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'System' LIMIT 1